[
    {
        "id":"01",
        "name":"Pyotr Ilyich Tchaikovsky",
        "description":"Pyotr Ilyich Tchaikovsky[a] (/tʃaɪˈkɒfski/ chy-KOF-skee;[2] Russian: Пётр Ильи́ч Чайко́вский,[a 2] IPA: [pʲɵtr ɨˈlʲjitɕ tɕɪjˈkofskʲɪj] (About this soundlisten); 7 May 1840 – 6 November 1893[a 3]) was a Russian composer of the Romantic period. He was the first Russian composer whose music would make a lasting impression internationally. He was honored in 1884 by Tsar Alexander III and awarded a lifetime pension.Although musically precocious, Tchaikovsky was educated for a career as a civil servant. There was scant opportunity for a musical career in Russia at the time and no system of public music education. When an opportunity for such an education arose, he entered the nascent Saint Petersburg Conservatory, from which he graduated in 1865. The formal Western-oriented teaching that he received there set him apart from composers of the contemporary nationalist movement embodied by the Russian composers of The Five with whom his professional relationship was mixed.Tchaikovsky's training set him on a path to reconcile what he had learned with the native musical practices to which he had been exposed from childhood. From that reconciliation, he forged a personal but unmistakably Russian style. The principles that governed melody, harmony and other fundamentals of Russian music ran completely counter to those that governed Western European music, which seemed to defeat the potential for using Russian music in large-scale Western composition or for forming a composite style, and it caused personal antipathies that dented Tchaikovsky's self-confidence. Russian culture exhibited a split personality, with its native and adopted elements having drifted apart increasingly since the time of Peter the Great. That resulted in uncertainty among the intelligentsia about the country's national identity, an ambiguity mirrored in Tchaikovsky's career.Despite his many popular successes, Tchaikovsky's life was punctuated by personal crises and depression. Contributory factors included his early separation from his mother for boarding school followed by his mother's early death; the death of his close friend and colleague Nikolai Rubinstein; and the collapse of the one enduring relationship of his adult life, his 13-year association with the wealthy widow Nadezhda von Meck, who was his patron even though they never met. His homosexuality, which he kept private, has traditionally also been considered a major factor though some musicologists now downplay its importance.[3] Tchaikovsky's sudden death at the age of 53 is generally ascribed to cholera, but there is an ongoing debate as to whether cholera was indeed the cause of his death.While his music has remained popular among audiences, critical opinions were initially mixed. Some Russians did not feel it was sufficiently representative of native musical values and expressed suspicion that Europeans accepted the music for its Western elements. In an apparent reinforcement of the latter claim, some Europeans lauded Tchaikovsky for offering music more substantive than base exoticism and said he transcended stereotypes of Russian classical music. Others dismissed Tchaikovsky's music as 'lacking in elevated thought'[4] and derided its formal workings as deficient because they did not stringently follow Western principles.",
        "pic":"Tchaikovsky.jpg"
    },
    {
        "id":"02",
        "name":"George Frideric (or Frederick) Handel",
        "description":"George Frideric (or Frederick) Handel (/ˈhændəl/;[a] baptised Georg Friederich Händel,[b] German: [ˈɡeːɔʁk ˈfʁiːdʁɪç ˈhɛndl̩]; 23 February 1685 – 14 April 1759[2][c]) was a German-British Baroque composer well known for his operas, oratorios, anthems, concerti grossi, and organ concertos. Handel received his training in Halle and worked as a composer in Hamburg and Italy before settling in London in 1712, where he spent the bulk of his career and became a naturalised British subject in 1727.[4] He was strongly influenced both by the middle-German polyphonic choral tradition and by composers of the Italian Baroque.Handel started three commercial opera companies to supply the English nobility with Italian opera. In 1737 he had a physical breakdown, changed direction creatively, and addressed the middle class and made a transition to English choral works. After his success with Messiah (1742), he never composed an Italian opera again. His orchestral Water Music and Music for the Royal Fireworks remain steadfastly popular.[5] One of his four coronation anthems, Zadok the Priest, has been performed at every British coronation since 1727. Almost blind, he died in 1759, a respected and rich man, and was given a state funeral at Westminster Abbey.Handel composed more than forty opera serias over a period of more than thirty years. Since the late 1960s, interest in Handel's music has grown. The musicologist Winton Dean wrote that 'Handel was not only a great composer; he was a dramatic genius of the first order.'[6] His music was admired by Classical-era composers, including Mozart and Beethoven.",
        "pic":"George_Frideric_Handel.jpg"
    },
    {
        "id":"03",
        "name":"Johann Sebastian Bach",
        "description":"Johann Sebastian Bach[n 2] (31 March [O.S. 21 March] 1685 – 28 July 1750) was a German composer and musician of the late Baroque period. He is known for instrumental compositions such as the Cello Suites and Brandenburg Concertos; keyboard works such as the Goldberg Variations, The Well-Tempered Clavier and the Toccata and Fugue in D minor; and vocal music such as the St Matthew Passion and the Mass in B minor. Since the 19th-century Bach Revival, he has been generally regarded as one of the greatest composers in the history of Western music.The Bach family already counted several composers when Johann Sebastian was born as the last child of a city musician in Eisenach. After being orphaned at the age of 10, he lived for five years with his eldest brother Johann Christoph, after which he continued his musical formation in Lüneburg. From 1703 he was back in Thuringia, working as a musician for Protestant churches in Arnstadt and Mühlhausen and, for longer stretches of time, at courts in Weimar, where he expanded his organ repertory, and Köthen, where he was mostly engaged with chamber music. From 1723 he was employed as Thomaskantor (cantor at St. Thomas) in Leipzig. He composed music for the principal Lutheran churches of the city, and for its university's student ensemble Collegium Musicum. From 1726 he published some of his keyboard and organ music. In Leipzig, as had happened during some of his earlier positions, he had difficult relations with his employer, a situation that was little remedied when he was granted the title of court composer by his sovereign, Augustus III, Elector of Saxony and King of Poland, in 1736. In the last decades of his life he reworked and extended many of his earlier compositions. He died of complications after eye surgery in 1750 at the age of 65.Bach enriched established German styles through his mastery of counterpoint, harmonic and motivic organisation,[4] and his adaptation of rhythms, forms, and textures from abroad, particularly from Italy and France. Bach's compositions include hundreds of cantatas, both sacred and secular. He composed Latin church music, Passions, oratorios, and motets. He often adopted Lutheran hymns, not only in his larger vocal works, but for instance also in his four-part chorales and his sacred songs. He wrote extensively for organ and for other keyboard instruments. He composed concertos, for instance for violin and for harpsichord, and suites, as chamber music as well as for orchestra. Many of his works employ the genres of canon and fugue.Throughout the 18th century, Bach was primarily valued as an organist, while his keyboard music, such as The Well-Tempered Clavier, was appreciated for its didactic qualities. The 19th century saw the publication of some major Bach biographies, and by the end of that century all of his known music had been printed. Dissemination of scholarship on the composer continued through periodicals (and later also websites) exclusively devoted to him, and other publications such as the Bach-Werke-Verzeichnis (BWV, a numbered catalogue of his works) and new critical editions of his compositions. His music was further popularised through a multitude of arrangements, including, the Air on the G String and 'Jesu, Joy of Man's Desiring', and of recordings, such as three different box sets with complete performances of the composer's oeuvre marking the 250th anniversary of his death.",
        "pic":"Johann_Sebastian_Bach.jpg"
    },
    {
        "id":"04",
        "name":"Ludwig van Beethoven",
        "description":"Ludwig van Beethoven (/ˈlʊdvɪɡ væn ˈbeɪtoʊvən/ (About this soundlisten), German: [ˈluːtvɪç fan ˈbeːtˌhoːfn̩] (About this soundlisten); baptised 17 December 1770 – 26 March 1827) was a German composer and pianist. Beethoven remains one of the most admired composers in the history of Western music; his works rank amongst the most performed of the classical music repertoire and span the transition from the Classical period to the Romantic era in classical music. His career has conventionally been divided into early, middle, and late periods. The 'early' period, during which he forged his craft, is typically considered to have lasted until 1802. From 1802 to around 1812, his 'middle' period showed an individual development from the 'classical' styles of Joseph Haydn and Wolfgang Amadeus Mozart, and is sometimes characterized as 'heroic'. During this time, he began to suffer increasingly from deafness. In his 'late' period from 1812 to his death in 1827, he extended his innovations in musical form and expression.Born in Bonn, Beethoven's musical talent was obvious at an early age, and he was initially harshly and intensively taught by his father Johann van Beethoven. Beethoven was later taught by the composer and conductor Christian Gottlob Neefe, under whose tutelage he published his first work, a set of keyboard variations, in 1783. He found relief from a dysfunctional home life with the family of Helene von Breuning, whose children he loved, befriended, and taught piano. At age 21, he moved to Vienna, which subsequently became his base, and studied composition with Haydn. Beethoven then gained a reputation as a virtuoso pianist, and he was soon patronized by Karl Alois, Prince Lichnowsky for compositions, which resulted in his three Opus 1 piano trios (the earliest works to which he accorded an opus number) in 1795.His first major orchestral work, the First Symphony, premiered in 1800, and his first set of string quartets was published in 1801. Despite his hearing deteriorating during this period, he continued to conduct, premiering his Third and Fifth Symphonies in 1804 and 1808, respectively. His Violin Concerto appeared in 1806. His last piano concerto (No. 5, Op. 73, known as the 'Emperor'), dedicated to his frequent patron Archduke Rudolf of Austria, was premiered in 1811, without Beethoven as soloist. He was almost completely deaf by 1814, and he then gave up performing and appearing in public. He described his problems with health and his unfulfilled personal life in two letters, his 'Heiligenstadt Testament' (1802) to his brothers and his unsent love letter to an unknown 'Immortal Beloved' (1812).After 1810, increasingly less socially involved, Beethoven composed many of his most admired works, including later symphonies, mature chamber music and the late piano sonatas. His only opera, Fidelio, first performed in 1805, was revised to its final version in 1814. He composed Missa solemnis between 1819 and 1823 and his final Symphony, No. 9, one of the first examples of a choral symphony, between 1822 and 1824. Written in his last years, his late string quartets, including the Grosse Fuge, of 1825–1826 are among his final achievements. After some months of bedridden illness, he died in 1827. Beethoven's works remain mainstays of the classical music repertoire.",
        "pic":"Beethoven.jpg"
    },
    {
        "id":"05",
        "name":"Wolfgang Amadeus Mozart",
        "description":"Wolfgang Amadeus Mozart (27 January 1756 – 5 December 1791), baptised as Johannes Chrysostomus Wolfgangus Theophilus Mozart, was a prolific and influential composer of the Classical period. Despite his short life, his rapid pace of composition resulted in more than 600 works of virtually every genre of his time. Many of these compositions are acknowledged as pinnacles of the symphonic, concertante, chamber, operatic, and choral repertoire. Among the greatest composers in the history of Western music, his elder colleague Joseph Haydn wrote: 'posterity will not see such a talent again in 100 years'.Born in Salzburg, in the Holy Roman Empire, Mozart showed prodigious ability from his earliest childhood. Already competent on keyboard and violin, he composed from the age of five and performed before European royalty, embarking on a grand tour and then three trips to Italy. At 17, Mozart was engaged as a musician at the Salzburg court but grew restless and travelled in search of a better position.at the time of his early death at the age of 35. The circumstances of his death are largely uncertain, and have thus been much mythologized.",
        "pic":"Wolfgang-Amadeus-Mozart.jpg"
    },
    {
        "id":"06",
        "name":"Antonio Lucio Vivaldi",
        "description":"Antonio Lucio Vivaldi 4 March 1678 – 28 July 1741) was an Italian[6] Baroque composer, virtuoso violinist, teacher, impresario, and Roman Catholic priest.Born in Venice, the capital of the Venetian Republic, Vivaldi is regarded as one of the greatest Baroque composers. His influence during his lifetime was widespread across Europe, giving origin to many imitators and admirers and was paramount in the development of Johann Sebastian Bach's instrumental music and the French concerto (Michel Corrette, Jean-Joseph de Mondonville, Louis-Nicholas Clérambault).Vivaldi composed many instrumental concertos, for the violin and a variety of other musical instruments, as well as sacred choral works and more than fifty operas. His best-known work is a series of violin concertos known as the Four Seasons. Many of his compositions were written for the all-female music ensemble of the Ospedale della Pietà, a home for abandoned children. Vivaldi had worked as a Catholic priest for 18 months and was employed from 1703 to 1715 and from 1723 to 1740. Vivaldi also had some success with expensive stagings of his operas in Venice, Mantua and Vienna. After meeting the Emperor Charles VI, Vivaldi moved to Vienna, hoping for royal support. However, the Emperor died soon after Vivaldi's arrival, and Vivaldi himself died in poverty less than a year later.After almost two centuries of decline, Vivaldi's musical reputation underwent a revival in the early 20th century, with much scholarly research devoted to his work. Many of Vivaldi's compositions, once thought lost, have been rediscovered – in one case as recently as 2006. His music remains widely popular in the present day and is regularly played all over the world.",
        "pic":"Vivaldi.jpg"
    }
]