[
    {
        "id":"01",
        "name":"Gregory Porter",
        "description":"Gregory Porter (born November 4, 1971)[1] is an American singer, songwriter and actor. He has twice won the Grammy Award for Best Jazz Vocal Album: first in 2014 for Liquid Spirit and then again in 2017 for Take Me to the Alley.Gregory Porter was born in Sacramento, California, and was raised in Bakersfield, California, where his mother Ruth was a minister.[3] Porter has seven siblings. His mother was a large influence on his life, having encouraged him to sing in church at an early age. His father, Rufus, was largely absent from his life. Says Porter, 'Everybody had some issues with their father, even if he was in the house. He may have been emotionally absent. My father was just straight-up absent. I hung out with him just a few days in my life. And it wasn't a long time. He just didn’t seem to be completely interested in being there. Maybe he was, I don't know.A 1989 graduate of Highland High School, he received a full athletic scholarship as a football lineman to San Diego State University (SDSU Aztecs), but a shoulder injury during his junior year cut short his football career.Porter's mother died from cancer when he was 21 years old. From her death bed, she entreated him: 'Sing, baby, sing!''",
        "pic":"Gregory_Porter.jpg"
    },
    {
        "id":"02",
        "name":"Esperanza Spalding",
        "description":"Esperanza Emily Spalding (born October 18, 1984) is an American jazz bassist, singer, songwriter, and composer. Her accolades include four Grammy Awards, a Boston Music Award, and a Soul Train Music Award.A native of Portland, Oregon, Spalding began playing music professionally in her childhood, performing as a violinist in the Chamber Music Society of Oregon at age five. She was later both self-taught and trained on a number of instruments, including guitar and bass. Her proficiency earned her academic scholarships to Portland State University and the Berklee College of Music, both of which she attended, studying music.Spalding released her first album, Junjo, in 2006 on the Spanish label Ayva Musica, after which she signed with the independent American label Heads Up, who released her 2007 self-titled album. Her third studio album, Chamber Music Society (2010), was a commercial success, charting at number 34 on the Billboard 200, and resulting in Spalding winning her first Grammy Award for Best New Artist; Spalding was the first jazz artist to win in this category.[2] She saw further acclaim for her fourth release, Radio Music Society (2012), which earned the Grammy for Best Jazz Vocal Album, as well as the track 'City of Roses' winning for Best Arrangement, Instrument and Vocals.After spending the following several years performing as a supporting band player, Spalding released her fifth studio album, a funk rock-inspired concept album titled Emily's D+Evolution, co-produced by Tony Visconti, on Concord Records. The following year, she released the album Exposure, which was limited to 7,777 copies. Her subsequent sixth studio record, 12 Little Spells, was released in 2019, and peaked at number one on Billboard's Top Jazz Albums. The album also saw Spalding nominated for two Grammy Awards, winning in the Best Jazz Vocal Album category.In addition to writing and performing music, Spalding has also worked as an instructor, first at the Berklee College of Music, beginning at age 20. In 2017, Spalding was appointed professor of the Practice of Music at Harvard University. In 2018, Spalding received an honorary doctorate of music from her alma mater, Berklee College of Music, and served as commencement speaker at the ceremony.",
        "pic":"Esperanza_Spalding.jpg"
    },
    {
        "id":"03",
        "name":"Melody Gardot",
        "description":"Melody Gardot ( born February 2, 1985) is an American jazz singer.At the age of 19, Gardot was involved in a bicycle accident and sustained a head injury. Music played a critical role in her recovery. She became an advocate of music therapy,[1] visiting hospitals and universities to discuss its benefits. In 2012, she gave her name to a music therapy program in New Jersey.Gardot was born in New Jersey and was brought up by her grandparents. Her grandmother was a Polish immigrant. Her mother, a photographer, traveled often, so they had few possessions and lived out of suitcases. Gardot studied fashion at the Community College of Philadelphia.",
        "pic":"Melody_Gardot.jpg"
    },
    {
        "id":"04",
        "name":"Johnny Hartman",
        "description":"John Maurice Hartman (July 3, 1923 – September 15, 1983)[1] was an American jazz singer who specialized in ballads. He sang and recorded with Earl Hines' and Dizzy Gillespie's big bands and with Erroll Garner. He is best remembered for his collaboration in 1963 with saxophonist John Coltrane, John Coltrane and Johnny Hartman, a landmark album for both him and Coltrane.Born in Louisiana and raised in Chicago, Hartman began singing and playing the piano by the age of eight. He attended DuSable High School studying music under Walter Dyett before receiving a scholarship to the Chicago Musical College.[2] He sang as a private in the Army's Special Services during World War II, but his first professional break came in September 1946 when he won a singing contest at the Apollo Theater earning him a one-week engagement with Earl Hines which lasted a year. His first recordings were with Marl Young during that time though it was his collaboration with Hines that gave him notable exposure. After the Hines orchestra broke up, Dizzy Gillespie invited him to join his big band for an eight-week tour of California in 1948. After leaving Gillespie, Hartman worked for a short time with pianist Erroll Garner before beginning a solo early in 1950.",
        "pic":"Johnny_Hartman.jpg"
    },
    {
        "id":"05",
        "name":"Frank Sinatra",
        "description":"Francis Albert Sinatra (December 12, 1915 – May 14, 1998) was an American singer and actor who is generally viewed as one of the greatest musical artists of the 20th century. He is one of the best-selling music artists of all time, having sold an estimated 150 million records worldwide.Born to Italian immigrants in Hoboken, New Jersey, Sinatra was greatly influenced by the intimate, easy-listening vocal style of Bing Crosby[3] and began his musical career in the swing era with bandleaders Harry James and Tommy Dorsey. Sinatra found success as a solo artist after he signed with Columbia Records in 1943, becoming the idol of the 'bobby soxers'. Sinatra released his debut album, The Voice of Frank Sinatra, in 1946. However, by the early 1950s, his professional career had stalled and he turned to Las Vegas, where he became one of its best known residency performers as part of the Rat Pack. His career was reborn in 1953 with the success of the film From Here to Eternity, his performance subsequently earning him an Academy Award, and a Golden Globe Award for Best Supporting Actor. Sinatra then released several critically lauded albums, some of which are retrospectively noted as being among the first 'concept albums', including In the Wee Small Hours (1955), Songs for Swingin' Lovers! (1956), Come Fly with Me (1958), Only the Lonely (1958), No One Cares (1959), and Nice 'n' Easy (1960).",
        "pic":"Frank_Sinatra.jpg"
    },
    {
        "id":"06",
        "name":"Billie Holiday",
        "description":"Eleanora Fagan (April 7, 1915 – July 17, 1959), known professionally as Billie Holiday, was an American jazz and swing music singer. Nicknamed 'Lady Day' by her friend and music partner Lester Young, Holiday had an innovative influence on jazz music and pop singing. Her vocal style, strongly inspired by jazz instrumentalists, pioneered a new way of manipulating phrasing and tempo. She was known for her vocal delivery and improvisational skills.After a turbulent childhood, Holiday began singing in nightclubs in Harlem, where she was heard by producer John Hammond, who liked her voice. She signed a recording contract with Brunswick in 1935. Collaborations with Teddy Wilson produced the hit 'What a Little Moonlight Can Do', which became a jazz standard. Throughout the 1930s and 1940s, Holiday had mainstream success on labels such as Columbia and Decca. By the late 1940s, however, she was beset with legal troubles and drug abuse. After a short prison sentence, she performed at a sold-out concert at Carnegie Hall. She was a successful concert performer throughout the 1950s with two further sold-out shows at Carnegie Hall. Because of personal struggles and an altered voice, her final recordings were met with mixed reaction but were mild commercial successes. Her final album, Lady in Satin, was released in 1958. Holiday died of cirrhosis on July 17, 1959, at age 44.",
        "pic":"Billie_Holiday.jpg"
    }
]