[
    {
        "id":"01",
        "name":"Eminem",
        "description":"Marshall Bruce Mathers III (born October 17, 1972), commonly known by his stage name Eminem (often stylized as EMINƎM) is an American male rapper, musician, record producer, and actor. Considered the person who popularized hip hop in Central America, its global success and Eminem's acclaimed music products broke the racial barrier to make it easier for white rappers to embrace it. He became a representative of the lower class of American society. He is a influential artist of various genres. Eminem is one of the best-selling music artists of all time, with an estimated sales of more than 220 million records worldwide. He is also the best-selling music artist in the United States in the 2000s and the best-selling male music artist of the 2010s, ranking third overall. Billboard named him the Artist of the decade (2000–2009). He has won many prestigious awards, including 15 Grammy Awards, 8 American Music Awards, 17 Billboard Music Awards, an Oscar and a MTV Europe Global Music Icon Award. He has ten albums topped the Billboard 200, making him the only artist to achieve this feat and five number one singles on the Billboard Hot 100. Some featured albums: Infinite, The Marshall Mathers LP, The Eminem Show ...",
        "pic":"eminem copy.jpg"
    },
    {
        "id":"02",
        "name":"MGK",
        "description":"Colson Baker (born April 22, 1990), known professionally as Machine Gun Kelly (MGK), is an American rapper, singer, and actor. He is noted for his compositional blending of contemporary and alternative hip hop with rock.Machine Gun Kelly released four mixtapes between 2007 and 2010 before signing with Bad Boy Records. He released his debut studio album, Lace Up, in 2012, which peaked at number four on the US Billboard 200 and contained his breakout single Wild Boy (featuring Waka Flocka Flame). His second and third albums, General Admission (2015) and Bloom (2017), achieved similar commercial success; the latter included the single Bad Things (with Camila Cabello), which peaked at number 4 on the Billboard Hot 100. His fourth album, Hotel Diablo (2019), included rap rock.Machine Gun Kelly released his fifth album, Tickets to My Downfall, in 2020; it marked a complete departure from hip hop and entry into pop punk. It debuted at number one on the Billboard 200, the only rock album to do so that year, and contained the single 'My Ex's Best Friend', which reached number 20 on the Hot 100.Machine Gun Kelly had his first starring role in the romantic drama Beyond the Lights (2014), and since appeared in the techno-thriller Nerve (2016), the horror Bird Box (2018), the comedy Big Time Adolescence and portrayed Tommy Lee in the biopic The Dirt (both 2019).",
        "pic":"MGK.png"
    },
    {
        "id":"03",
        "name":"Kendrick Lamar",
        "description":"Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper, songwriter and record producer. Since his mainstream debut in 2012 with Good Kid, M.A.A.D City, Lamar has been regarded as one of the most influential rappers of his generation.[1][2][3] Aside from his solo career, he is also known as a member of the hip hop supergroup Black Hippy alongside his Top Dawg Entertainment (TDE) label-mates Ab-Soul, Jay Rock, and Schoolboy Q.Raised in Compton, California, Lamar embarked on his musical career as a teenager under the stage name K.Dot, releasing a mixtape that garnered local attention and led to his signing with indie record label Top Dawg Entertainment. He began to gain recognition in 2010 after his first retail release, Overly Dedicated. The following year, he independently released his first studio album, Section.80, which included his first single 'HiiiPoWeR'. By that time, he had amassed a large online following and collaborated with several prominent hip hop artists.Lamar's major-label debut album, Good Kid, M.A.A.D City, was released in 2012 to critical acclaim. It would go on to be certified triple platinum by the Recording Industry Association of America (RIAA). His third album To Pimp a Butterfly (2015) incorporated elements of funk, soul, jazz, and spoken word. It became his first number one album on the Billboard 200, and was the most acclaimed album of the 2010s, according to statistics from Metacritic.[4] It was followed by Untitled Unmastered (2016), a collection of unreleased demos that originated during the recording sessions for To Pimp a Butterfly. He released his fourth album, Damn (2017) to further acclaim; its lead single 'Humble' topped the US Billboard Hot 100, while the album became the first non-classical and non-jazz album to be awarded the Pulitzer Prize for Music.[5] In 2018, he wrote and produced 14 songs for the soundtrack to the superhero film Black Panther, which also received critical acclaim.Lamar has received many accolades over the course of his career, including 13 Grammy Awards, two American Music Awards, six Billboard Music Awards, a Brit Award, 11 MTV Video Music Awards, a Pulitzer Prize, and an Academy Award nomination. In 2012, MTV named him the Hottest MC in the Game on their annual list.[6] Time named him one of the 100 most influential people in the world in 2016.[7] In 2015, he received the California State Senate's Generational Icon Award. Three of his studio albums have been listed in Rolling Stone's 500 Greatest Albums of All Time (2020).",
        "pic":"kendrick lamar.png"
    },
    {
        "id":"04",
        "name":"Tupac",
        "description":"Tupac Amaru Shakur (/ˈtuːpɑːk ʃəˈkʊər/ TOO-pahk shə-KOOR; born Lesane Parish Crooks, June 16, 1971 – September 13, 1996), better known by his stage name 2Pac and later by his alias Makaveli, was an American rapper. Considered one of the most influential rappers of all time, Shakur is among the best-selling music artists, having sold more than 75 million records worldwide. Much of Shakur's music has been noted for addressing contemporary social issues that plagued inner cities, and he is considered a symbol of activism against inequality.Shakur was born in Manhattan, New York City, but relocated to Baltimore, Maryland in 1984 and then the San Francisco Bay Area in 1988. He moved to Los Angeles in 1993 to further pursue his music career. By the time he released his debut album 2Pacalypse Now in 1991, he had become a central figure in West Coast hip hop, introducing social issues to the genre at a time when gangsta rap was dominant in the mainstream.[3][4] Shakur achieved further critical and commercial success with his follow-up albums Strictly 4 My N.I.G.G.A.Z... (1993) and Me Against the World (1995).In 1995, Shakur served eight months in prison on sexual abuse charges, but was released pending appeal after agreeing to sign with Marion 'Suge' Knight's label Death Row Records in exchange for Knight posting his bail. Following his release, Shakur became heavily involved in the growing East Coast–West Coast hip hop rivalry.[6] His double-disc album All Eyez on Me (1996), abandoning introspective lyrics for volatile gangsta rap,[7] was certified Diamond by the RIAA.On September 7, 1996, Shakur was shot four times by an unknown assailant in a drive-by shooting in Las Vegas, Nevada; he died six days later and the gunman was never captured. Shakur's friend-turned-rival, the Notorious B.I.G., was at first considered a suspect due to the pair's public feud, but was also murdered in another drive-by shooting six months later in March 1997 while visiting Los Angeles, California.[8][9] Five more albums have been released since Shakur's death, all of which have been certified Platinum in the United States.In 2002, he was inducted into the Hip-Hop Hall of Fame.[10] In 2017, he was inducted into the Rock and Roll Hall of Fame in his first year of eligibility.[11] Rolling Stone named Shakur in its list of the 100 Greatest Artists of All Time.[12] Outside music, Shakur also found considerable success as an actor, with his starring roles as Bishop in Juice (1992), Lucky in Poetic Justice (1993) where he starred alongside Janet Jackson, Ezekiel in Gridlock'd (1997), and Jake in Gang Related (1997), all of which garnered praise from critics.",
        "pic":"tupac.jpg"
    },
    {
        "id":"05",
        "name":"Biggie",
        "description":"Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, or simply Biggie,[3] was an American rapper and songwriter. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive laidback lyrical delivery, offsetting the lyrics' often grim content. His music was often semi-autobiographical, telling of hardship and criminality, but also of debauchery and celebration.Born and raised in Brooklyn, New York City, Wallace signed to Sean 'Puffy' Combs's label Bad Boy Records as it launched in 1993, and gained exposure through features on several other artists' singles that year. His debut album Ready to Die (1994) was met with widespread critical acclaim, and included his signature songs 'Juicy' and 'Big Poppa'. The album made him the central figure in East Coast hip hop, and restored New York's visibility at a time when the West Coast hip hop scene was dominating hip hop music.[5] Wallace was awarded the 1995 Billboard Music Awards' Rapper of the Year.[6] The following year, he led his protégé group Junior M.A.F.I.A., a team of himself and longtime friends, including Lil' Kim, to chart success.During 1996, while recording his second album, Wallace became ensnarled in the escalating East Coast–West Coast hip hop feud. Following Tupac Shakur's death in a drive-by shooting in Las Vegas in September 1996, speculations of involvement in Shakur's murder by criminal elements orbiting the Bad Boy circle circulated as a result of Wallace's public feud with Shakur. On March 9, 1997, six months after Shakur's death, Wallace was murdered in a drive-by shooting while visiting Los Angeles. The assailant remains unidentified. Wallace's second album Life After Death, a double album, was released two weeks later. It reached number one on the Billboard 200, and eventually achieved a diamond certification in the United StatesWith two more posthumous albums released, Wallace has certified sales of over 28 million copies in the United States,[8] including 21 million albums.[9] Rolling Stone has called him the 'greatest rapper that ever lived',[10] and Billboard named him the greatest rapper of all time.[11] The Source magazine named him the greatest rapper of all time in its 150th issue. In 2006, MTV ranked him at No. 3 on their list of The Greatest MCs of All Time, calling him possibly 'the most skillful ever on the mic'.[12] In 2020, he was inducted into the Rock and Roll Hall of Fame.",
        "pic":"Biggie.png"
    },
    {
        "id":"06",
        "name":"Travic Scott",
        "description":"Jacques Bermon Webster II (born April 30, 1991), known professionally as Travis Scott (formerly stylized as Travi$ Scott), is an American rapper and record producer.[4][5] His stage name is the namesake of a favorite uncle combined with the first name of one of his inspirations, Kid Cudi (whose real name is Scott Mescudi).[6]In 2012, Scott signed his first major-label contract with Epic Records. In November of the same year, Scott signed a publishing deal with Kanye West's GOOD Music, as part of its production wing Very GOOD Beats. In April 2013, Scott signed a recording contract with T.I.'s Grand Hustle imprint. Scott's first full-length project, the mixtape Owl Pharaoh, was self-released in 2013. It was followed with a second mixtape, Days Before Rodeo, in August 2014. His debut studio album, Rodeo (2015), was led by the hit single 'Antidote'. His second album, Birds in the Trap Sing McKnight (2016), became his first number one album on the Billboard 200. The following year, Scott released a collaborative album with Quavo titled Huncho Jack, Jack Huncho under the group name Huncho Jack.In 2018, his third studio album, Astroworld, was released to critical acclaim and produced his first Billboard Hot 100 number one single, 'Sicko Mode' (featuring Drake).[7] In late 2019, Scott's record label Cactus Jack Records released the compilation album JackBoys which became the first number one album on the Billboard 200 of the 2020s. After the release of his single 'Franchise' (featuring Young Thug and M.I.A.) in September 2020, Scott became the first artist on the Hot 100 to have three songs debut at number one in less than a year.[8] He has been nominated for eight Grammy Awards and won a Billboard Music Award and a Latin Grammy Award.Scott's career has gained notoriety for controversies and legal issues regarding safety at his concerts. On November 5, 2021, ten people died and hundreds were injured in a crowd crush moving toward the stage during Scott's performance at his Astroworld Festival in his hometown of Houston, Texas.",
        "pic":"Travic-Scott.jpg"
    }
]