[
    {
        "id":"01",
        "name":"The Beatles",
        "description":"The Beatles were an English rock band formed in Liverpool in 1960, whose best-known line-up comprised John Lennon, Paul McCartney, George Harrison and Ringo Starr. They are regarded as the most influential band of all time[1] and were integral to the development of 1960s counterculture and popular music's recognition as an art form.[2] Rooted in skiffle, beat and 1950s rock and roll, their sound incorporated elements of classical music and traditional pop in innovative ways; the band later explored music styles ranging from ballads and Indian music to psychedelia and hard rock. As pioneers in recording, songwriting and artistic presentation, the Beatles revolutionised many aspects of the music industry and were often publicised as leaders of the era's youth and sociocultural movements.Led by primary songwriters Lennon and McCartney, the Beatles evolved from Lennon's previous group, the Quarrymen, and built their reputation playing clubs in Liverpool and Hamburg over three years from 1960, initially with Stuart Sutcliffe playing bass. The core trio of Lennon, McCartney and Harrison, together since 1958, went through a succession of drummers, including Pete Best, before asking Starr to join them in 1962. Manager Brian Epstein moulded them into a professional act, and producer George Martin guided and developed their recordings, greatly expanding their domestic success after their first hit, 'Love Me Do', in late 1962. As their popularity grew into the intense fan frenzy dubbed 'Beatlemania', the band acquired the nickname 'the Fab Four', with Epstein, Martin and other members of the band's entourage sometimes given the informal title of 'fifth Beatle'.By early 1964, the Beatles were international stars and had achieved unprecedented levels of critical and commercial success. They became a leading force in Britain's cultural resurgence, ushering in the British Invasion of the United States pop market, and soon made their film debut with A Hard Day's Night (1964). From 1965 onwards, they produced records of greater sophistication, including the albums Rubber Soul (1965), Revolver (1966) and Sgt. Pepper's Lonely Hearts Club Band (1967), and enjoyed further commercial success with The Beatles (also known as 'the White Album', 1968) and Abbey Road (1969). Heralding the album era, their success elevated the album to be the dominant form of record consumption over singles; they also inspired a greater public interest in psychedelic drugs and Eastern spirituality, and furthered advancements in electronic music, album art and music videos. In 1968, they founded Apple Corps, a multi-armed multimedia corporation that continues to oversee projects related to the band's legacy. After the group's break-up in 1970, all principal members enjoyed success as solo artists and some partial reunions have occurred. Lennon was shot and killed in 1980 and Harrison died of lung cancer in 2001. McCartney and Starr remain musically active.The Beatles are the best-selling music act of all time, with estimated sales of 600 million units worldwide. They hold the record for most number-one albums on the UK Albums Chart (15), most number-one hits on the Billboard Hot 100 chart (20), and most singles sold in the UK (21.9 million). The band received many accolades, including seven Grammy Awards, four Brit Awards, an Academy Award (for Best Original Song Score for the 1970 film Let It Be) and fifteen Ivor Novello Awards. They were inducted into the Rock and Roll Hall of Fame in 1988, and each principal member was inducted individually between 1994 and 2015. In 2004 and 2011, the group topped Rolling Stone's lists of the greatest artists in history. Time magazine named them among the 20th century's 100 most important people.",
        "pic":"Beatles.jpg"
    },
    {
        "id":"02",
        "name":"Queen",
        "description":"Queen are a British rock band formed in London in 1970. Their classic line-up was Freddie Mercury (lead vocals, piano), Brian May (guitar, vocals), Roger Taylor (drums, vocals) and John Deacon (bass). Their earliest works were influenced by progressive rock, hard rock and heavy metal, but the band gradually ventured into more conventional and radio-friendly works by incorporating further styles, such as arena rock and pop rock.Before forming Queen, May and Taylor had played together in the band Smile. Mercury was a fan of Smile and encouraged them to experiment with more elaborate stage and recording techniques. He joined in 1970 and suggested the name 'Queen'. Deacon was recruited in February 1971, before the band released their eponymous debut album in 1973. Queen first charted in the UK with their second album, Queen II, in 1974. Sheer Heart Attack later that year and A Night at the Opera in 1975 brought them international success. The latter featured 'Bohemian Rhapsody', which stayed at number one in the UK for nine weeks and helped popularise the music video format.The band's 1977 album News of the World contained 'We Will Rock You' and 'We Are the Champions', which have become anthems at sporting events. By the early 1980s, Queen were one of the biggest stadium rock bands in the world. 'Another One Bites the Dust from The Game (1980) became their best-selling single, while their 1981 compilation album Greatest Hits is the best-selling album in the UK and is certified nine times platinum in the US. Their performance at the 1985 Live Aid concert is ranked among the greatest in rock history by various publications. In August 1986, Mercury gave his last performance with Queen at Knebworth, England. In 1991, he died of bronchopneumonia—a complication of AIDS. Deacon retired in 1997. Since 2004, May and Taylor have toured under the 'Queen + name with vocalists Paul Rodgers and Adam Lambert.Queen have been a global presence in popular culture for more than four decades. Estimates of their record sales range from 170 million to 300 million, making them one of the world's best-selling music artists. In 1990, Queen received the Brit Award for Outstanding Contribution to British Music. They were inducted into the Rock and Roll Hall of Fame in 2001, and with each member having composed hit singles all four were inducted into the Songwriters Hall of Fame in 2003. In 2005 they received the Ivor Novello Award for Outstanding Song Collection from the British Academy of Songwriters, Composers, and Authors, and in 2018 they were presented the Grammy Lifetime Achievement Award.",
        "pic":"Queen.jpg"
    },
    {
        "id":"03",
        "name":"Pink Floyd",
        "description":"Pink Floyd were an English rock band formed in London in 1964. Gaining an early following as one of the first British psychedelic groups, they were distinguished for their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.Pink Floyd were founded in 1964 by Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), Richard Wright (keyboards, vocals) and Bob Klose (guitars); Klose quit in 1965. Under Barrett's leadership, they released two charting singles and the successful debut album The Piper at the Gates of Dawn (1967). Guitarist and vocalist David Gilmour joined in December 1967; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind the band's peak success with the albums The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977) and The Wall (1979). The musical film based on The Wall, Pink Floyd – The Wall (1982), won two BAFTA Awards.Following personal tensions, Wright left Pink Floyd in 1979, followed by Waters in 1985. Gilmour and Mason continued as Pink Floyd, rejoined later by Wright. The band produced two more albums—A Momentary Lapse of Reason (1987) and The Division Bell (1994)—and toured in support of both albums before entering a long period of inactivity. In 2005, all but Barrett reunited for a one-off performance at the global awareness event Live 8. Barrett died in 2006, and Wright in 2008. The last Pink Floyd studio album, The Endless River (2014), was based on unreleased material from the Division Bell recording sessions.By 2013, Pink Floyd had sold more than 250 million records worldwide, making them one of the best-selling music artists of all time. Wish You Were Here, The Dark Side of the Moon, and The Wall are among the best-selling albums of all time, and the latter two have been inducted into the Grammy Hall of Fame.[1] Four of the band's albums topped the US Billboard 200, and five of their albums topped the UK Album Chart. Hit singles include 'See Emily Play' (1967), 'Money' (1973), 'Another Brick in the Wall, Part 2' (1979), 'Not Now John' (1983), 'On the Turning Away' (1987) and 'High Hopes' (1994). The band also composed several film scores. They were inducted into the US Rock and Roll Hall of Fame in 1996 and the UK Music Hall of Fame in 2005. In 2008, King Carl XVI Gustaf of Sweden presented Pink Floyd with the Polar Music Prize for their contribution to modern music.",
        "pic":"Pink_Floyd.jpg"
    },
    {
        "id":"04",
        "name":"Led Zeppelin",
        "description":"Led Zeppelin were an English rock band formed in London in 1968. The group consisted of vocalist Robert Plant, guitarist Jimmy Page, bassist/keyboardist John Paul Jones, and drummer John Bonham. With a heavy, guitar-driven sound, they are cited as one of the progenitors of hard rock and heavy metal, although their style drew from a variety of influences, including blues and folk music. Led Zeppelin have been credited as significantly impacting the nature of the music industry, particularly in the development of album-oriented rock (AOR) and stadium rock.Originally named the New Yardbirds, Led Zeppelin's deal with Atlantic Records gave them considerable artistic freedom. Initially unpopular with critics, they achieved significant commercial success with eight studio albums over ten years. Their 1969 debut, Led Zeppelin, was a top-ten album in several countries and featured such tracks as 'Good Times Bad Times', 'Dazed and Confused' and 'Communication Breakdown'. Led Zeppelin II (1969) was their first number-one album, and yielded 'Ramble On' and 'Whole Lotta Love'. In 1970 they released Led Zeppelin III which featured 'Immigrant Song'. Their untitled fourth album, commonly known as Led Zeppelin IV (1971), is one of the best-selling albums in history with 37 million copies sold. The album includes 'Black Dog', 'Rock and Roll' and 'Stairway to Heaven', with the latter being among the most popular and influential works in rock history. Houses of the Holy (1973) yielded 'The Ocean', 'Over the Hills and Far Away' and 'The Rain Song'. Physical Graffiti (1975), a double album, featured 'Trampled Under Foot' and 'Kashmir'.Page wrote most of Led Zeppelin's music, particularly early in their career, while Plant wrote most of the lyrics. Jones's keyboard-based compositions later became central to their music, which featured increasing experimentation. The latter half of their career saw a series of record-breaking tours that earned the group a reputation for excess and debauchery. Although they remained commercially and critically successful, their touring and output, which included Presence (1976) and In Through the Out Door (1979), grew limited, and the group disbanded following Bonham's death in 1980. Since then the surviving former members sporadically collaborated and participated in one-off reunions. The most successful of these was the 2007 Ahmet Ertegun Tribute Concert in London, with Bonham's son Jason Bonham on drums.Led Zeppelin are one of the best-selling music artists of all time; their total record sales are estimated to be between 200 to 300 million units worldwide. They achieved eight consecutive UK number-one albums and six number-one albums on the US Billboard 200, with five of their albums certified Diamond in the US. Rolling Stone magazine described them as 'the heaviest band of all time', 'the biggest band of the Seventies', and 'unquestionably one of the most enduring bands in rock history'. They were inducted into the Rock and Roll Hall of Fame in 1995; the museum's biography of the band states that they were 'as influential' during the 1970s as the Beatles were during the 1960s.",
        "pic":"Led_Zeppelin.jpg"
    },
    {
        "id":"05",
        "name":"The Rolling Stones",
        "description":"The Rolling Stones are an English rock band formed in London in 1962. Active for almost six decades, they are one of the most popular and enduring bands of the rock era. In the early 1960s, the Rolling Stones pioneered the gritty, heavier-driven sound that came to define hard rock.[1] Their first stable line-up comprised vocalist Mick Jagger, multi-instrumentalist Brian Jones, guitarist Keith Richards, bassist Bill Wyman, and drummer Charlie Watts. During their formative years Jones was the primary leader: he assembled the band, named it, and drove their sound and image. After Andrew Loog Oldham became the group's manager in 1963, he encouraged them to write their own songs. Jagger and Richards became the primary creative force behind the band, alienating Jones, who developed a drug addiction that interfered with his ability to contribute meaningfully.Rooted in blues and early rock and roll, the Rolling Stones started out playing covers and were at the forefront of the British Invasion in 1964, also being identified with the youthful and rebellious counterculture of the 1960s. They then found greater success with their own material as '(I Can't Get No) Satisfaction' (1965), 'Get Off of My Cloud' (1965) and 'Paint It Black' (1966) became international No. 1 hits. Aftermath (1966) – their first entirely original album – is considered the most important of their formative records.[2] In 1967, they had the double-sided hit 'Ruby Tuesday'/'Let's Spend the Night Together' and experimented with psychedelic rock on Their Satanic Majesties Request. They returned to their roots with such hits as 'Jumpin' Jack Flash' (1968) and 'Honky Tonk Women' (1969), and albums such as Beggars Banquet (1968), featuring 'Sympathy for the Devil', and Let It Bleed (1969), featuring 'You Can't Always Get What You Want' and 'Gimme Shelter'. Let It Bleed was the first of five consecutive No. 1 albums in the UK.Jones left the band shortly before his death in 1969, having been replaced by guitarist Mick Taylor. That year they were first introduced on stage as 'The Greatest Rock and Roll Band in the World'. Sticky Fingers (1971), which yielded 'Brown Sugar' and included the first usage of their tongue and lips logo, was their first of eight consecutive No. 1 studio albums in the US. Exile on Main St. (1972), featuring 'Tumbling Dice', and Goats Head Soup (1973), yielding the hit ballad 'Angie', were also best sellers. Taylor was replaced by Ronnie Wood in 1974. The band continued to release successful albums including their two largest sellers: Some Girls (1978), featuring 'Miss You'; and Tattoo You (1981), featuring 'Start Me Up'. Steel Wheels (1989) was widely considered a comeback album and was followed by Voodoo Lounge (1994), a worldwide number one album. Both releases were promoted by large stadium and arena tours as the Stones continued to be a huge concert attraction; by 2007 they had four of the top five highest-grossing concert tours of all time. From Wyman's departure in 1993 to Watts' death in 2021, the band continued as a four-piece core, with Darryl Jones playing bass on tour and on most studio recordings. Their latest album, Blue & Lonesome (2016), became their twelfth UK number-one album.The Rolling Stones' estimated record sales of 200 million makes them one of the best-selling music artists of all time. The band has won three Grammy Awards and a Grammy Lifetime Achievement Award. They were inducted into the Rock and Roll Hall of Fame in 1989 and the UK Music Hall of Fame in 2004. In 2019, Billboard magazine ranked the Rolling Stones second on their list of the 'Greatest Artists of All Time' based on US chart success.[3] They are ranked fourth on Rolling Stone's list of the Greatest Artists of All Time.[4]",
        "pic":"The-Rolling-Stones.jpg"
    },
    {
        "id":"06",
        "name":"Metallica",
        "description":"Metallica is an American heavy metal band. The band was formed in 1981 in Los Angeles by vocalist/guitarist James Hetfield and drummer Lars Ulrich, and has been based in San Francisco for most of its career.[1][2] The band's fast tempos, instrumentals and aggressive musicianship made them one of the founding 'big four' bands of thrash metal, alongside Megadeth, Anthrax and Slayer. Metallica's current lineup comprises founding members and primary songwriters Hetfield and Ulrich, longtime lead guitarist Kirk Hammett, and bassist Robert Trujillo. Guitarist Dave Mustaine (who went on to form Megadeth after being fired from the band) and bassists Ron McGovney, Cliff Burton (who died in a bus accident in Sweden in 1986) and Jason Newsted are former members of the band.After two albums on Megaforce Records and signing to major label Elektra in 1984, Metallica first found commercial success with the release of its third album, Master of Puppets (1986), which has been described as one of the heaviest and most influential thrash metal albums. Their next album, ...And Justice for All (1988), was also successful and gave Metallica their first Grammy Award nomination. Its eponymous fifth album, Metallica (1991), the band's first not to root predominantly in thrash metal, appealed to a more mainstream audience, achieving substantial commercial success and selling over 16 million copies in the United States to date, making it the best-selling album of the SoundScan era. After experimenting with different genres and directions in subsequent releases, the band returned to its thrash metal roots with the release of its ninth album, Death Magnetic (2008), which drew similar praise to that of the band's earlier albums. Their most recent album is Hardwired... to Self-Destruct, released in 2016.In 2000, Metallica led the case against the peer-to-peer file sharing service Napster, in which the band and several other artists filed lawsuits against the service for sharing their copyright-protected material without consent; after reaching a settlement, Napster became a pay-to-use service in 2003. Metallica was the subject of the acclaimed 2004 documentary film Metallica: Some Kind of Monster, which documented the troubled production of the band's eighth album, St. Anger (2003), and the internal struggles within the band at the time. In 2009, Metallica was inducted into the Rock and Roll Hall of Fame. The band wrote the screenplay for and starred in the 2013 IMAX concert film Metallica: Through the Never, in which the band performed live against a fictional thriller storyline.Metallica has released ten studio albums, four live albums, a cover album, five extended plays, 37 singles and 39 music videos. The band has won nine Grammy Awards from 23 nominations, and its last six studio albums (beginning with Metallica) have consecutively debuted at number one on the Billboard 200. Metallica ranks as one of the most commercially successful bands of all time, having sold over 125 million albums worldwide as of 2018.[3] Metallica has been listed as one of the greatest artists of all time by magazines such as Rolling Stone, which ranked them at no. 61 on its 100 Greatest Artists of All Time list.[4] As of 2017, Metallica is the third best-selling music artist since Nielsen SoundScan began tracking sales in 1991,[5] selling a total of 58 million albums in the United States.[6]",
        "pic":"Metallica.jpg"
    }
]